#Создать строку равную третьему символу введенной строки.
string = input()
s = string[2]
print("Третий символ:", s)
