#Даны 2 действительных числа a и b.Получить их сумму, разность и произведение
a=10
b=2
summa= a+b
print ("сумма:", summa)
razn= a-b
print ("разность:", razn)
proizv= a*b
print ("произведение:",proizv)
