#Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
a=2
b=8
c=(a+b)//2
print("среднее арифметическое:",c)
d= (a*b)** .5
print("среднее геометрическое:",d)
