#Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a=2
v= a*a*a
print("объем куба:", v)
s= 6*(a*a)
print("площадь его боковой поверхности:", s)
