#Создать строку равную введенной строке без последних двух символов.
string = input()
s = string[0:-2]
print("Без последних двух символов:", s)
