#Создать строку равную предпоследнему символу введенной строки.
string = input()
s = string[-2]
print("Предпоследний символ:", s)
