#Создать строку равную первым пяти символам введенной строки.
string = input()
s = string[0:5]
print("Первые пять символов:", s)
