#Создать строку равную всем элеиентам введенной строки с четными индексами.
string = input()
s = string[::2]
print("С четными индексами:", s)
